Repository: enpiicom/wp-plugin-tamara-checkout
Catalog: languages/tamara-*.po
Languages: ar

source: Go to Tamara and pay
ar: زور تمارا و ادفع

source: Enable/Disable
ar: تفعيل/الغاء

source: Enable Tamara Gateway
ar: تفعيل خدمة تمارا

source: Tamara Working Mode
ar: خدمة تمارا في وضع التشغيل

source: Choose Tamara Working Mode
ar: اختر وضع التشغيل لخدمة تمارا

source: This setting specifies whether you will process live transactions, or whether you will process simulated transactions using the Tamara Sandbox.
ar: هذا الحقل يحدد وضع التشغيل, اذ ما كان على وضع البيئة الفعلية أو البيئة التجريبية.

source: Thank you for choosing Tamara! We will inform you once the merchant ships your order.
ar: شكرا لاختيارك تمارا! سيتم تنويهك عند شحن الطلب.

source: Please make sure the Tamara payment status of the order is <strong>captured</strong> before making a refund.
ar: فضلاً يرجى التأكد من حالة الطلب أنها <strong>تم تسليمه</strong> قبل عمل استرجاع.

source: Tamara Checkout
ar: دفع تمارا

source: Allow to Buy Now Pay Later with Tamara payment gateway, based on Enpii Base
ar: اسمح بالشراء الآن والدفع لاحقًا باستخدام بوابة الدفع تمارا، المبنية على Enpii Base

source: Log file not found or it contains nothing
ar: لم يتم العثور على ملف السجل أو أنه لا يحتوي على أي شيء

source: Error! Incorrect Order.
ar: خطأ! الطلب غير صحيح.

source: Order authorisation process failed.
ar: فشلت عملية تأكيد الطلب.

source: Order authorised failed.
ar: فشلت عملية قبول الطلب.

source: Order authorised successfully.
ar: تم التأكيد على الطلب بنجاح.

source: Payment Status: %s, Payment Type: %s, Payment Instalments: %s.
ar: حالة الدفع: %s, نوع الدفع: %s, أقساط الدفع: %s.

source: Payment Status: %s, Payment Type: %s.
ar: حالة الدفع: %s, نوع الدفع: %s.

source: Error! Incorrect Order. WC Order ID:
ar: خطأ! الطلب غير صحيح. WC Order ID:

source: Order cancelled successfully. Cancel Id: %s.
ar: تم الغاء الطلب بنجاح. معرف الألغاء: %s

source: Error when trying to cancel order with Tamara.
ar: حدث خطأ أثناء محاولة إلغاء الطلب مع تمارا.

source: Error with Tamara API: %s
ar: خطأ مع تمارا API: %s

source: Order fully captured successfully. Capture Id: %s, Captured Amount %s.
ar: تم تسليم الطلب بالكامل بنجاح. معرف التسوية: %s, مبلغ التسوية %s

source: Error when trying to capture order with Tamara.
ar: حدث خطأ أثناء محاولة تسليم الطلب مع تمارا.

source: Update order status because the order is captured on Tamara. Capture Id: %s, Captured Amount %s.
ar: قم بتحديث حالة الطلب لأنه تم تسليم الطلب في تمارا. معرف التسوية: %s، مبلغ التسوية %s.

source: Order has been refunded successfully. Capture Id: %1$s, Refund Id: %2$s, Refunded amount: %3$s.
ar: تم استرجاع الطلب بنجاح. معرف التسليم: %1$s، معرف الاسترجاع: %2$s، المبلغ المسترجع: %3$s.

source: Error when trying to refund with Tamara.
ar: حدث خطأ أثناء محاولة استرجاع الأموال مع تمارا.

source: Unable to create a refund. Capture ID not found.
ar: تعذر النظام من إنشاء استرجاع. لم يتم العثور على معرف التسليم.

# Order status
source: Tamara Cancelled
ar: تمارا ألغت

source: Tamara Cancelled <span class="count">(%s)</span>
ar: تمارا ألغت <span class="count">(%s)</span>

# Order status
source: Tamara Failed
ar: تمارا فشلت

source: Tamara Failed <span class="count">(%s)</span>
ar: تمارا فشلت <span class="count">(%s)</span>

# Order status
source: Tamara Capture Failed
ar: فشلت تسليم تمارا

source: Tamara Capture Failed <span class="count">(%s)</span>
ar: فشلت تسليم تمارا <span class="count">(%s)</span>

# Order status
source: Tamara Authorise Failed
ar: فشل تأكيد تمارا

source: Tamara Authorise Failed <span class="count">(%s)</span>
ar: فشل تأكيد تمارا <span class="count">(%s)</span>

source: Tamara Service timeout or disconnected. Error message: "%s".
ar: أنتهت مهلة خدمة تمارا أو تم قطع الإتصال بها. رسالة الخطأ: "%s".

source: Tamara webhook event `%s` for this order has just happened. Tamara Order Id `%s`
ar: لقد حدث للتو حدث webhook تمارا `%s` لهذا الطلب. معرف طلب تمارا `%s`

source: %s: required.
ar: %s: مطلوب.

source: %s is incorrect.
ar: %s غير صحيح.

source: Tamara Settings Help Texts
ar: نصوص تعليمات إعدادات تمارا

source: Confidential Configuration
ar: إعدادات الخصوصية

source: Update Your Confidential Configuration Received From Tamara. You can find that on http://partners.tamara.co.
ar: قم بتحديث إعدادات الخصوصية الذي تم تلقيها من تمارا. يمكنك العثور على ذلك على http://partners.tamara.co.

source: Order Statuses Mappings
ar: تعيينات حالات الطلب

source: Manage Order Statuses Mappings
ar: إدارة تعيينات حالات الطلب

source: Order Status when Tamara Order is Authorised
ar: حالة الطلب عندما يتم تأكيد طلب تمارا

source: Mapping status for orders that have Tamara Payment authorised successfully on Tamara side. This process happens after the Customers complete the checkout on Tamara side successfully.
ar: حالة التعيين للطلبات التي تم تأكيد دفع تمارا لها بنجاح من جانب تمارا. تحدث هذه العملية بعد أن يكمل العملاء عملية الدفع على جانب تمارا بنجاح.

source: Order Status when Tamara Order is Canceled
ar: حالة الطلب عند إلغاء طلب تمارا

source: Mapping status for orders that are cancelled (Tamara calls `canceled`). The cancellation may happen because the customer actively cancel the order or the cancellation happens on the Partners portal or from Tamara side. Tamara triggers the Cancellation process and send to the website (via the webhook).
ar: تعيين حالة الطلبات التي تم إلغاؤها (تتصل تمارا بـ 'canceled'). قد يحدث الإلغاء لأن العميل يقوم بإلغاء الطلب بشكل فعال أو يحدث الإلغاء على بوابة الشركاء أو من جانب تمارا. تقوم تمارا بتشغيل عملية الإلغاء وإرسالها إلى موقع الويب (عبر webhook).

source: Order Status when Tamara Order Fails
ar: حالة الطلب عند فشل طلب تمارا

source: Mapping status for orders that are declined by Tamara. The Order failure may happen because the customer does not have a good credit history or having on-going orders with Tamara. Tamara triggers the Decline process and send to the website (via the webhook).
ar: حالة التعيين للطلبات التي تم رفضها بواسطة تمارا. قد يحدث فشل الطلب لأن العميل ليس لديه سجل ائتماني جيد أو لديه طلبات مستمرة مع تمارا. تقوم تمارا بتشغيل عملية الرفض وإرسالها إلى موقع الويب (عبر webhook).

source: Order Status when Tamara Authorisation fails
ar: حالة الطلب عند فشل تأكيد تمارا

source: Mapping status for orders when the payment failed at the Authorisation process on Tamara.
ar: تعيين حالة الطلبات عند فشل الدفع في عملية التأكيد في تمارا.

source: Order Status when Capture fails on Tamara
ar: حالة الطلب عند فشل التسليم على تمارا

source: Mapping status for orders when the payment failed at the Capture process on Tamara.
ar: تعيين حالة الطلبات عند فشل الدفع في عملية التسليم في تمارا.

source: Order Statuses to Trigger Tamara Events
ar: حالات الطلب لتشغيل أحداث تمارا

source: Manage Order Statuses Trigger
ar: إدارة مشغل حالات الطلب

source: Order Status that triggers the Tamara Cancel process for an order
ar: حالة الطلب التي تؤدي إلى تشغيل عملية إلغاء تمارا لأحد الطلبات

source: When you update an order to this status, Tamara Checkout plugin would connect to Tamara API to trigger the Cancel process for the correspoding order on Tamara side.
ar: عندما تقوم بتحديث طلب إلى هذه الحالة، سيتصل ملحق Tamara Checkout بـ Tamara API لبدء عملية الإلغاء للطلب المقابل من جانب تمارا.

source: Order Status that triggers Tamara Capture process for an order
ar: حالة الطلب التي تؤدي إلى تشغيل عملية تسليم تمارا للطلب

source: When you update an order to this status it would connect to Tamara API to trigger the Capture payment process on Tamara. Only when the Capture process done, the payment is available for the settlement.
ar: عندما تقوم بتحديث طلب إلى هذه الحالة، فإنه سيتم الاتصال بـ Tamara API لبدء عملية تسليم المبلغ على Tamara. فقط عند الانتهاء من عملية التسليم، يصبح الدفع متاحًا للتسوية.

source: Tamara Custom Settings
ar: إعدادات تخصيص تمارا

source: Configure Tamara Custom Settings
ar: ضبط إعدادات تخصيص تمارا

source: Show Tamara Custom Settings
ar: إظهار إعدادات تخصيص تمارا

source: Excluded Product Ids
ar: إستثناء معرفات المنتج

source: Enter the product ids that you want to exclude from using Tamara to checkout (These ids are separated by commas e.g. `101, 205`).
ar: أدخل معرفات المنتج التي تريد إستثنائها من استخدام تمارا للدفع (يتم فصل هذه المعرفات بفواصل، على سبيل المثال `101، 205`).

source: Excluded Product Category Ids
ar: إستثناء معرفات فئات المنتج

source: Enter the product category ids that you want to exclude from using Tamara to checkout (These ids are separated by commas e.g. `26, 104`).
ar: أدخل معرفات فئة المنتج التي تريد إستثنائها من استخدام تمارا للدفع (يتم فصل هذه المعرفات بفواصل، على سبيل المثال `26، 104`).

source: Tamara Advanced Settings
ar: إعدادات تمارا المتقدمة

source: Configure Tamara Advanced Settings <br> <p class="tamara-highlight">Please read the descriptions of these settings carefully before making a change or please contact Tamara Team for more details.</p>
ar: ضبط إعدادات تمارا المتقدمة <br> <p class="tamara-highlight">يرجى قراءة أوصاف هذه الإعدادات بعناية قبل إجراء أي تغيير أو يرجى الاتصال بفريق تمارا للحصول على مزيد من التفاصيل.</p>

source: Show Tamara Advanced Settings
ar: إظهار إعدادات تمارا المتقدمة

source: Force Enable Phone
ar: إجبار تفعيل الهاتف

source: Enable Billing/Shipping Phone Field at Checkout step
ar: قم بتمكين حقل الهاتف للفتورة/الشحن في خطوة الدفع

source: If you tick on this setting, the billing/shipping Phone field will be forced to display on the checkout screen, which is required to use for Tamara payment gateway.
ar: إذا قمت بتحديد هذا الإعداد، فسيتم عرض حقل هاتف الفوترة/الشحن على شاشة الدفع، وهو أمر مطلوب لاستخدامه في بوابة دفع تمارا.

source: Force Enable Email
ar: إجبار تفعيل البريد الإلكتروني

source: Enable Email Field at Checkout step
ar: تفعيل حقل البريد الإلكتروني في خطوة الدفع

source: If you tick on this setting, the billing/shipping Email field will be forced to display on the checkout screen, which is required to use for Tamara payment gateway.
ar: إذا قمت بتحديد هذا الإعداد، فسيتم عرض حقل البريد الإلكتروني للفوترة/الشحن على شاشة الدفع، وهو أمر مطلوب لاستخدامه في بوابة دفع تمارا.

source: Disable Single Product Details Popup (PDP) Widget
ar: تعطيل ظهور واجهة المستخدم لتفاصيل المنتج الواحد 'Disable Single Product Details Popup (PDP) Widget'

source: Disable PDP Widget on Single Product Page
ar: تعطيل واجهة المستخدم على صفحة المنتج الواحد 'Disable PDP Widget on Single Product Page'

source: In you tick on this setting, the PDP widget will be hidden on the single product page.
ar: عند تحديد هذا الإعداد، سيتم إخفاء عنصر واجهة المستخدم (widget) PDP على صفحة المنتج الفردية.

source: PDP Widget Position
ar: موضع واجهة المستخدم 'PDP Widget Position'

source: Choose a position where you want to display the Tamara Payment Popup Widget on single product page (https://www.businessbloomer.com/woocommerce-visual-hook-guide-single-product-page/). Or, you can use shortcode with attributes to show it on custom pages e.g. [tamara_show_popup price="199" currency="SAR" language="en"]
ar: اختر الموضع الذي تريد عرض واجهة المستخدم (Tamara Payment Popup Widget) فيه على صفحة المنتج الواحد (https://www.businessbloomer.com/woocommerce-visual-hook-guide-single-product-page/). أو يمكنك استخدام الرمز القصير مع السمات لإظهاره على الصفحات المخصصة، على سبيل المثال. [tamara_show_popup السعر="199" العملة="SAR" language="ar"]

source: Disable Cart Popup Widget
ar: تعطيل ظهور واجهة المستخدم (widget) لسلة التسوق

source: Force to Disable Cart Popup Widget
ar: إجبار تعطيل ظهور واجهة المستخدم (widget) لسلة التسوق

source: In you tick on this setting, the popup widget will be hidden on the cart page.
ar: عند تحديد هذا الإعداد، سيتم إخفاء ظهور واجهة المستخدم (widget) في صفحة سلة التسوق.

source: Cart Popup Widget Position
ar: موضع واجهة المستخدم (widget) لسلة التسوق

source: Choose a position where you want to display the Tamara Payment Popup Widget on cart page.
ar: اختر الموضع الذي تريد عرض أداة Tamara Payment Popup Widget فيه على صفحة سلة التسوق

source: Tamara Payment Success Url
ar: عنوان تمارا لنجاح الدفع Url

source: Enter the custom SUCCESS url for customers to be redirected to after PAYMENT is SUCCESSFUL (leave it blank to use the default one).
ar: أدخل عنوان URL المخصص للنجاح ليتم إعادة توجيه العملاء إليه بعد نجاح الدفع (اتركه فارغًا لاستخدام العنوان الافتراضي).

source: Tamara Payment Cancel Url
ar: عنوان تمارا لإلغاء الدفع Url

source: Enter the custom CANCEL url for customers to be redirected to after PAYMENT is CANCELLED (leave it blank to use the default one).
ar: أدخل عنوان URL المخصص للإلغاء ليتم إعادة توجيه العملاء إليه بعد إلغاء الدفع (اتركه فارغًا لاستخدام العنوان الافتراضي).

source: Tamara Payment Failure Url
ar: عنوان تمارا لفشل الدفع Url

source: Enter the custom FAILURE url for customers to be redirected to after PAYMENT is FAILED (leave it blank to use the default one).
ar: أدخل عنوان URL المخصص للفشل ليتم إعادة توجيه العملاء إليه بعد فشل الدفع (اتركه فارغًا لاستخدام العنوان الافتراضي).

source: Debug Info
ar: معلومات التصحيح

source: Show Debug Info
ar: إظهار معلومات التصحيح

source: Platform & Extensions:
ar: النظام الأساسي والإضافات:

source: PHP loaded extensions
ar: ملحقات PHP المحملة

source: Enable Tamara Custom Log Message
ar: تمكين تخصيص رسالة سجل تمارا

source: In you tick on this setting, all the message logs will be written and saved to the Tamara custom log file in your upload directory.
ar: عند تحديد هذا الإعداد، سيتم كتابة جميع سجلات الرسائل وحفظها في ملف سجل تمارا المخصص في ملف التحميل الخاص بك.

source: Tamara Custom Log file
ar: تخصيص سجل ملف تمارا

source: The log download link will be <strong>available below</strong>, if the value is not empty
ar: سيكون رابط تنزيل السجل <strong>متاحًا أدناه</strong>، إذا لم تكن القيمة فارغة

source: Tamara Checkout Plugin Version: %s
ar: إصدار ملحق دفع تمارا: %s

source: WooCommerce Version: %s
ar: إصدار ووكومرس: %s

source: WordPress Version: %s
ar: إصدار ووردبريس: %s

source: PHP Version: %s
ar: إصدار PHP: %s

source: Here you can browse some help texts and find solutions for common issues with our plugin.
ar: يمكنك هنا تصفح بعض نصوص المساعدة والعثور على حلول للمشكلات الشائعة باستخدام الملحق الإضافي الخاص بنا.

source: If there is any issue with your API URL, API Token, Notification Key or Public Key please contact Tamara Team for support at <a href="mailto:merchant.support@tamara.co">merchant.support@tamara.co</a>
ar: إذا كانت هناك أي مشكلة في عنوان URL لواجهة برمجة التطبيقات أو رمز واجهة برمجة التطبيقات أو مفتاح الإشعارات أو المفتاح العام، فيرجى الاتصال بفريق Tamara للحصول على الدعم على <a href="mailto:merchant.support@tamara.co">merchant.support@tamara.co</a>

source: Show More Help Texts
ar: عرض المزيد من نصوص المساعدة

source: You can use the shortcode with attributes to show Tamara product widget on custom pages e.g. <strong>[tamara_show_popup price="600" currency="SAR" language="en"].</strong>
ar: يمكنك استخدام الرمز القصير مع السمات لإظهار أداة منتج تمارا على الصفحات المخصصة، على سبيل المثال. <strong>[tamara_show_popup السعر="600" العملة="SAR" language="en"].</strong>

source: For Tamara payment success URL, you can use action <strong>after_tamara_success</strong> to handle further actions.
ar: بالنسبة إلى عنوان URL لنجاح دفع تمارا، يمكنك استخدام الإجراء <strong>after_tamara_success</strong> للتعامل مع المزيد من الإجراءات.

source: For Tamara payment cancel URL, you can use action <strong>after_tamara_cancel</strong> to handle further actions.
ar: بالنسبة إلى عنوان URL لإلغاء دفع تمارا، يمكنك استخدام الإجراء <strong>after_tamara_cancel</strong> للتعامل مع المزيد من الإجراءات.

source: For Tamara payment failed URL, you can use action <strong>after_tamara_failure</strong> to handle further actions.
ar: بالنسبة إلى عنوان URL لفشل دفع تمارا، يمكنك استخدام الإجراء <strong>after_tamara_failure</strong> للتعامل مع المزيد من الإجراءات.

source: All the debug log messages sent from Tamara will be written and saved to the Tamara custom log file on your server.
ar: ستتم كتابة جميع رسائل سجل التصحيح المرسلة من تمارا وحفظها في ملف سجل تمارا المخصص على الخادم الخاص بك.

source: If you want to solve stuck orders (when Tamara inform you, you may want to click %s to enable to process).
ar: إذا كنت تريد حل الطلبات المتعلقة عندما تعلمك تمارا، قد ترغب في النقر فوق %s لتمكين المعالجة.

source: Solve Stuck Orders
ar: حل الطلبات المعلقة

source: Download Custom Log file
ar: تنزيل ملف سجل مخصص

source: Done! The script to resolve the Stuck Orders has been executed.
ar: تم! تم تنفيذ البرنامج النصي لحل الطلبات المعلقة.

source: Tamara Service unavailable! Please try again later.
ar: خدمة تمارا غير متوفرة! الرجاء معاودة المحاولة في وقت لاحق.

source: ATTENTION! SANDBOX MODE, FOR TESTING PURPOSES ONLY, NO REAL TRANSACTIONS HAPPEN. IF YOU ARE THE CUSTOMER, PLEASE DON'T PROCEED!
ar: تنبيه! وضع البيئة التجريبية (SANDBOX MODE) لأغراض الاختبار فقط، لا تحدث أي معاملات حقيقية. إذا كنت العميل، يرجى عدم المتابعة!

source: See the <a target="_blank" href="https://docs.tamara.co/docs/testing-scenarios">Tamara Sandbox Testing Guide</a> for more details.
ar: راجع <a target="_blank" href="https://docs.tamara.co/docs/testing-scenarios">دليل الاختبار في البيئة التجريبية</a> لمزيد من التفاصيل.

source: Invalid WC_Order
ar: WC_Order غير صالح

source: Phone and Email are mandatory when checking out with Tamara
ar: يعد الهاتف والبريد الإلكتروني إلزاميين عند تسجيل المغادرة مع تمارا

source: Invalid WC_Order_Refund
ar: WC_Order_Refund غير صالح

source: Tamara - Buy Now Pay Later
ar: تمارا - اشتري الآن وادفع لاحقًا

source: Buy Now Pay Later, no hidden fees, with Tamara
ar: اشترِ الآن وادفع لاحقًا، بدون رسوم مخفية، مع تمارا

source: Tamara Payment Method
ar: طريقة الدفع مع تمارا

source: Tamara Pay In 3
ar: قسم فاتورتك على 3 دفعات مع تمارا

source: Settings
ar: الإعدادات

source: Phone
ar: الهاتف

source: Email
ar: البريد إلاكتروني

source: Plugin <strong>%s</strong> is required.
ar: ملحق <strong>%s</strong> مطلوب.

source: Plugin <strong>%s</strong> is disabled.
ar: ملحق <strong>%s</strong> معطل.

source: Tamara Buy Now Pay Later
ar: اشتري الآن وادفع لاحقًا مع تمارا

source: We are not able to process your order via Tamara currently, please try again later or proceed with a different payment method.
ar: نحن غير قادرين على معالجة طلبك عبر تمارا حاليًا, يرجى المحاولة مرة أخرى لاحقًا أو المتابعة بطريقة دفع مختلفة.

source: Tamara is currently unavailable, please try again later.
ar: خدمة تمارا غير متوفرة حاليا، فضلًا المحاولة مرة اخرى في وقت لاحق.

source: Invalid Consumer Phone Number.
ar: رقم هاتف العميل غير صحيح.

source: Invalid Phone Number.
ar: رقم الهاتف غير صحيح.

source: We do not support cross currencies. Please select the correct currency for your country.
ar: لا ندعم التحويل بين العملات. يرجى اختيار العملة الصحيحة لبلدتك.

source: Invalid Billing Address Phone Number.
ar: رقم هاتف عنوان الفاتورة غير صحيح.

source: Invalid Shipping Address Phone Number.
ar: رقم هاتف عنوان الشحن غير صحيح.

source: The grand total of order is over/under limit of Tamara.
ar: المبلغ الإجمالي للطلب أكثر\أقل من الحد في تمارا.

source: We do not support your delivery country.
ar: لا ندعم بلد التوصيل الخاص بك.

source: Mapping status for order according to Tamara action result.
ar: تعيين حالة الطلب وفقًا لنتيجة إجراء تمارا.

source: Configure Tamara Advanced Settings
ar: ضبط إعدادات تمارا المتقدمة

source: Please read the descriptions of these settings carefully before making a change or please contact Tamara Team for more details.
ar: فضلًا قم بقراءة الوصف لهذه الإعدادات بعناية قبل إجراء اي تغيير أو قم بالتواصل مع فريق تمارا للمزيد من المعلوما.

source: Update order statuses used to trigger events to Tamara
ar: تحديث حالات الطلب المستخدمة لتشغيل الأحداث إلى تمارة

source: Tamara doesn't work with block-based checkout, so you need to use the SHORTCODE [woocommmece_checkout] for your checkout page.
ar: لا تعمل Tamara مع سيكّ التحقق القائم على الكتل، لذلك تحتاج إلى استخدام رمز مختصر [woocommerce_checkout] لصفحة السداد الخاصة بك.

source: Tamara only works with qualified customers at the checkout step, so some of your customers may not see Tamara at the checkout step.
ar: تعمل Tamara فقط مع العملاء المؤهلين في خطوة الدفع، لذلك قد لا يرى بعض عملائك Tamara على صفحة الدفع.
